# Exercice 1 

Reproduisez le tutoriel en le traduisant (y compris au niveau
du code) en Français jusqu’à la section Reshaping (inclus - Vous vous arrêterez avant la partie Time Series).

URL: http://pandas.pydata.org/pandas-docs/stable/10min.html

# 10 minutes pour apprendre Pandas

In [12]:
## importation des fichiers 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Creation d'objet

création de serie:

In [13]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Création d'un DataFrame en utilisant un tableau numpy, avec un index datetime et des colonnes étiquetées:

In [14]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.278700  0.786376 -1.886946 -1.322068
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946
2013-01-05 -0.825394  2.125847  0.331057  0.758615
2013-01-06  0.149034 -0.223519 -0.754926  0.789168

Création d'un DataFrame en utilisant un dict d'objets qui peuvent être convertis en séries.

In [16]:
df2 = pd.DataFrame({ 'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Avoir des dtypes specific

In [17]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Si vous utilisez IPython, l'achèvement des tabulations (tab complexion) pour les noms de colonnes (ainsi que les attributs publics) est automatiquement activé. Voici un sous-ensemble des attributs qui seront complétés:

 df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

Comme vous pouvez le voir, les colonnes A, B, C et D sont automatiquement complétées. E aussi d'ailleurs; le reste des attributs a été tronqué par souci de concision.

# Visualisation des données

In [18]:
df.head()

                   A         B         C         D
2013-01-01 -0.278700  0.786376 -1.886946 -1.322068
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946
2013-01-05 -0.825394  2.125847  0.331057  0.758615

In [19]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946
2013-01-05 -0.825394  2.125847  0.331057  0.758615
2013-01-06  0.149034 -0.223519 -0.754926  0.789168

Afficher l'index, les colonnes et les données numériques (numpy data) sous-jacentes

In [20]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [22]:
 df.values

array([[-0.27870041,  0.78637604, -1.88694643, -1.32206829],
       [-0.77651145,  1.16839525,  0.33788864, -0.18394662],
       [-0.12832512, -0.71647103, -0.21401778, -0.13065459],
       [-0.22713578, -0.52044159, -1.75626667, -0.05694607],
       [-0.8253941 ,  2.12584745,  0.33105705,  0.75861508],
       [ 0.14903446, -0.22351903, -0.75492642,  0.78916771]])

afficher un résumé rapide au niveau statistique (summary) de vos données -> on utilise describe

In [23]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.347839  0.436698 -0.657202 -0.024305
std    0.381114  1.112896  0.989246  0.774177
min   -0.825394 -0.716471 -1.886946 -1.322068
25%   -0.652059 -0.446211 -1.505932 -0.170624
50%   -0.252918  0.281429 -0.484472 -0.093800
75%   -0.153028  1.072890  0.194788  0.554725
max    0.149034  2.125847  0.337889  0.789168

Transposer vos données -> T

In [24]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.278700   -0.776511   -0.128325   -0.227136   -0.825394    0.149034
B    0.786376    1.168395   -0.716471   -0.520442    2.125847   -0.223519
C   -1.886946    0.337889   -0.214018   -1.756267    0.331057   -0.754926
D   -1.322068   -0.183947   -0.130655   -0.056946    0.758615    0.789168

 trier par un axe : -> axis =1 (A,B,C,D)
                       axis = 0 (dates) 
 l'exemple suivant est descendant

In [25]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.322068 -1.886946  0.786376 -0.278700
2013-01-02 -0.183947  0.337889  1.168395 -0.776511
2013-01-03 -0.130655 -0.214018 -0.716471 -0.128325
2013-01-04 -0.056946 -1.756267 -0.520442 -0.227136
2013-01-05  0.758615  0.331057  2.125847 -0.825394
2013-01-06  0.789168 -0.754926 -0.223519  0.149034

In [26]:
df

                   A         B         C         D
2013-01-01 -0.278700  0.786376 -1.886946 -1.322068
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946
2013-01-05 -0.825394  2.125847  0.331057  0.758615
2013-01-06  0.149034 -0.223519 -0.754926  0.789168

tri par valeurs

In [27]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946
2013-01-06  0.149034 -0.223519 -0.754926  0.789168
2013-01-01 -0.278700  0.786376 -1.886946 -1.322068
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-05 -0.825394  2.125847  0.331057  0.758615

# selection

Remarque :  Bien que les expressions Python / Numpy standard pour la sélection et le paramétrage soient intuitives et pratiques pour le travail interactif, pour le code de production, nous recommandons les méthodes d'accès aux données pandas optimisées, .at, .iat, .loc, .iloc et .ix.

# getting

Sélection d'une seule colonne, qui donne une série, équivalent à df.A.

In [28]:
df['A']

2013-01-01   -0.278700
2013-01-02   -0.776511
2013-01-03   -0.128325
2013-01-04   -0.227136
2013-01-05   -0.825394
2013-01-06    0.149034
Freq: D, Name: A, dtype: float64

slicing

In [29]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.278700  0.786376 -1.886946 -1.322068
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655

In [30]:
 df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946

Selection par label

section transversale en utilisant une étiquette

In [31]:
df.loc[dates[0]]

A   -0.278700
B    0.786376
C   -1.886946
D   -1.322068
Name: 2013-01-01 00:00:00, dtype: float64

Sélection sur un multi-axe par étiquette

In [32]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.278700  0.786376
2013-01-02 -0.776511  1.168395
2013-01-03 -0.128325 -0.716471
2013-01-04 -0.227136 -0.520442
2013-01-05 -0.825394  2.125847
2013-01-06  0.149034 -0.223519

Slicing, les deux points de terminaison sont inclus

In [33]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02 -0.776511  1.168395
2013-01-03 -0.128325 -0.716471
2013-01-04 -0.227136 -0.520442


Réduction des dimensions de l'objet retourné

In [34]:
df.loc['20130102',['A','B']]

A   -0.776511
B    1.168395
Name: 2013-01-02 00:00:00, dtype: float64

pour avoir un scalaire

In [35]:
df.loc[dates[0],'A']

-0.2787004086196864

pour avoir un acces rapide à un scalaire

In [36]:
df.at[dates[0],'A']

-0.2787004086196864

# Selection par position

In [37]:
#avec des entiers
df.iloc[3]

A   -0.227136
B   -0.520442
C   -1.756267
D   -0.056946
Name: 2013-01-04 00:00:00, dtype: float64

In [38]:
# avec des slices d'entier
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.227136 -0.520442
2013-01-05 -0.825394  2.125847

In [39]:
# avec les position 
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.776511  0.337889
2013-01-03 -0.128325 -0.214018
2013-01-05 -0.825394  0.331057

In [40]:
 df.iloc[1:3,:]#row

                   A         B         C         D
2013-01-02 -0.776511  1.168395  0.337889 -0.183947
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655

In [41]:
df.iloc[:,1:3]#columns

                   B         C
2013-01-01  0.786376 -1.886946
2013-01-02  1.168395  0.337889
2013-01-03 -0.716471 -0.214018
2013-01-04 -0.520442 -1.756267
2013-01-05  2.125847  0.331057
2013-01-06 -0.223519 -0.754926

In [42]:
df.iloc[1,1] #valeur explicite

1.1683952510429236

In [43]:
df.iat[1,1] #plus rapide

1.1683952510429236

# Indexation booléenne

Utilisation des valeurs d'une seule colonne pour sélectionner des données

In [44]:
df[df.A > 0]

                   A         B         C         D
2013-01-06  0.149034 -0.223519 -0.754926  0.789168

Selecting values from a DataFrame where a boolean condition is met.

In [45]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  0.786376       NaN       NaN
2013-01-02       NaN  1.168395  0.337889       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN       NaN       NaN       NaN
2013-01-05       NaN  2.125847  0.331057  0.758615
2013-01-06  0.149034       NaN       NaN  0.789168

Utilisation de la méthode isin () pour le filtrage

In [46]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.278700  0.786376 -1.886946 -1.322068    one
2013-01-02 -0.776511  1.168395  0.337889 -0.183947    one
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655    two
2013-01-04 -0.227136 -0.520442 -1.756267 -0.056946  three
2013-01-05 -0.825394  2.125847  0.331057  0.758615   four
2013-01-06  0.149034 -0.223519 -0.754926  0.789168  three

In [47]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.128325 -0.716471 -0.214018 -0.130655   two
2013-01-05 -0.825394  2.125847  0.331057  0.758615  four

# Setting

La définition d'une nouvelle colonne aligne automatiquement les données par les index

In [48]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [49]:
df['F'] = s1

 Définition des valeurs par libellé (label)

In [50]:
df.at[dates[0],'A'] = 0

definition des valeurs par position

In [51]:
df.iat[0,1] = 0

Réglage par affectation avec un tableau numpy

In [52]:
 df.loc[:,'D'] = np.array([5] * len(df))

resultat des opérations antérieures

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.886946  5  NaN
2013-01-02 -0.776511  1.168395  0.337889  5  1.0
2013-01-03 -0.128325 -0.716471 -0.214018  5  2.0
2013-01-04 -0.227136 -0.520442 -1.756267  5  3.0
2013-01-05 -0.825394  2.125847  0.331057  5  4.0
2013-01-06  0.149034 -0.223519 -0.754926  5  5.0

une opération where avec parametrage

In [54]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.886946 -5  NaN
2013-01-02 -0.776511 -1.168395 -0.337889 -5 -1.0
2013-01-03 -0.128325 -0.716471 -0.214018 -5 -2.0
2013-01-04 -0.227136 -0.520442 -1.756267 -5 -3.0
2013-01-05 -0.825394 -2.125847 -0.331057 -5 -4.0
2013-01-06 -0.149034 -0.223519 -0.754926 -5 -5.0

# Donnés manquantes

donnés manquantes : np.nan

La réindexation permet de modifier / ajouter / supprimer l'index sur un axe spécifié. Cela renvoie une copie des données.

In [55]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [56]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [57]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.886946  5  NaN  1.0
2013-01-02 -0.776511  1.168395  0.337889  5  1.0  1.0
2013-01-03 -0.128325 -0.716471 -0.214018  5  2.0  NaN
2013-01-04 -0.227136 -0.520442 -1.756267  5  3.0  NaN

Pour supprimer des lignes contenant des données manquantes

In [58]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -0.776511  1.168395  0.337889  5  1.0  1.0

Remplir les données manquantes

In [59]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.886946  5  5.0  1.0
2013-01-02 -0.776511  1.168395  0.337889  5  1.0  1.0
2013-01-03 -0.128325 -0.716471 -0.214018  5  2.0  5.0
2013-01-04 -0.227136 -0.520442 -1.756267  5  3.0  5.0

Pour obtenir le masque booléen où les valeurs sont 'nan'

In [60]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operation

Stats


Les opérations en général excluent les données manquantes.

In [68]:
df.mean()

A   -0.301389
B    0.305635
C   -0.657202
D    5.000000
F    3.000000
dtype: float64

même opération pour l'autre axes

In [62]:
df.mean(1)

2013-01-01    0.778263
2013-01-02    1.345954
2013-01-03    1.188237
2013-01-04    1.099231
2013-01-05    2.126302
2013-01-06    1.834118
Freq: D, dtype: float64

Opérer avec des objets de dimension différente et nécessitant un alignement. En outre, pandas diffuse automatiquement le long de la dimension spécifiée.

In [70]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [71]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.128325 -1.716471 -1.214018  4.0  1.0
2013-01-04 -3.227136 -3.520442 -4.756267  2.0  0.0
2013-01-05 -5.825394 -2.874153 -4.668943  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# application 

application des fonctions aux données

In [72]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.886946   5   NaN
2013-01-02 -0.776511  1.168395 -1.549058  10   1.0
2013-01-03 -0.904837  0.451924 -1.763076  15   3.0
2013-01-04 -1.131972 -0.068517 -3.519342  20   6.0
2013-01-05 -1.957366  2.057330 -3.188285  25  10.0
2013-01-06 -1.808332  1.833811 -3.943212  30  15.0

In [73]:
df.apply(lambda x: x.max() - x.min())

A    0.974429
B    2.842318
C    2.224835
D    0.000000
F    4.000000
dtype: float64

# histogramming

In [75]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    4
1    4
2    0
3    1
4    1
5    3
6    0
7    6
8    2
9    2
dtype: int32

In [76]:
s.value_counts()

4    2
2    2
1    2
0    2
6    1
3    1
dtype: int64

# string méthodes

Series est équipé d'un ensemble de méthodes de traitement de chaîne dans l'attribut str qui le rendent facile à utiliser sur chaque élément du tableau, comme dans l'extrait de code ci-dessous. 
Notez que pattern-matching dans str utilise généralement des expressions régulières par défaut (et dans certains cas les utilise toujours).

In [78]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Fusion 

Concat 


pandas facilites des objets Series, DataFrame et Panel avec différents types de logique d'ensemble pour les index et la fonctionnalité d'algèbre relationnelle dans le cas d'opérations de type join / merge.

On conncate les objets pandas ensemble avec 'concat()'

In [79]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.818940 -0.768467  1.898703 -0.491681
1 -1.675752  1.294988 -0.620150  2.714367
2  0.527217  0.544140 -0.965231 -0.608732
3 -2.036764 -0.484487  1.027595 -0.549382
4 -0.866152  2.005486 -0.477800  1.174505
5 -1.343243  0.976249  0.955089  0.636459
6  0.198268 -1.853020 -0.421686  0.401345
7 -1.040698  2.349117  0.328342 -0.685632
8  0.392276 -1.340148  0.782756 -0.852222
9  0.591905  0.318498 -0.334438  0.280112

In [81]:
pieces = [df[:3], df[3:7], df[7:]] #sépare en differents morceaux

In [82]:
pd.concat(pieces)

          0         1         2         3
0 -1.818940 -0.768467  1.898703 -0.491681
1 -1.675752  1.294988 -0.620150  2.714367
2  0.527217  0.544140 -0.965231 -0.608732
3 -2.036764 -0.484487  1.027595 -0.549382
4 -0.866152  2.005486 -0.477800  1.174505
5 -1.343243  0.976249  0.955089  0.636459
6  0.198268 -1.853020 -0.421686  0.401345
7 -1.040698  2.349117  0.328342 -0.685632
8  0.392276 -1.340148  0.782756 -0.852222
9  0.591905  0.318498 -0.334438  0.280112